[
    {
        "id": 1,
        "title": "Introducción a la Computación",
        "author": "J.Glenn Brookshear",
        "year": "2012",
        "cover": "./img/01.jpg",
        "description": "Dirigido a la asignatura de introducción a la informática, impartida en todos los grados de ingeniería en primer curso. El libro, utiliza una amplia cobertura y hace una exposición clara de la presentación completa de la computación dinámica. Muy accesible para estudiantes de todos los niveles, Glenn Brookshear utiliza un contexto independiente del lenguaje para impulsar el desarrollo de la comprensión práctica y realista de este campo. Una visión general de las áreas más importantes en computación (p. ej. Redes, sistemas operativos, arquitectura de computadores, algoritmos) proporciona a los estudiantes un nivel general de habilidad para cursos superiores, que es lo que persigue la actual asignatura de Grado.",
        "driveLink": "https://drive.google.com/file/d/19BwwlegCYCSQM6oQYB12AV8XGYHMZUiB/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 2,
        "title": "Introduccion a la Informática",
        "author": "George Beekman",
        "year": "1999",
        "cover": "./img/02.webp",
        "description": "Ante la necesidad de tener un buen manual de Introducción a la informática para no informáticos, debido sobre todo al gran número de alumnos que cursan esta materia (30.000) alumnos, presentamos este libro, que además de ser un best seller e ir ya por su sexta edición, en España es un libro conocido, utilizándose su versión inglesa en varias universidades, como la Universidad Rey Juan Carlos y la Universidad Carlos III, universidades que al traducir el libro lo pondrán de texto, aportando un mercado cautivo de 1.500 alumnos. Material Complementario: www.computerconfluence.comAnte la necesidad de tener un buen manual de Introducción a la informática para no informáticos, debido sobre todo al gran número de alumnos que cursan esta materia ",
        "driveLink": "https://drive.google.com/file/d/1T7kgVygh8qcz7Myy8QlAINmo07aUzYvJ/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 3,
        "title": "Organización y arquitectura de computadores",
        "author": "William Stallings",
        "year": "1987",
        "cover": "./img/03.jpg",
        "description": "La finalidad de este texto es que el lector aprenda los principios de diseño e implementación de la organización y arquitectura de los computadores actuales. Por consiguiente, un tratamiento puramente conceptual o teórico sería inadecuado. Este libro utiliza ejemplos de muchas máquinas diferentes para clarificar y reforzar los conceptos presentados. Muchos, pero no todos, de los ejemplos se han ideado a partir de dos familias de computadores: Intel Pentium 4 y PowerPC IBM/Freescale. Estos dos sistemas juntos abarcan la mayoría de las tendencias en diseño de lso computadores de hoy en día. El Pentium 4 es esencialmente un computador con un conjunto complejo de instrucciones (CISC, Complex Instruction Set Computer) con características RISC, mientras que el PowerPC es esencialmente un computador con un conjunto reducido de instrucciones",
        "driveLink": "https://drive.google.com/file/d/1G7OWgiT6HgjH4IZFbaa-89oOvop1vsiT/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática", "03. Arquitectura de Computadoras"],
        "type": "Obligatoria"
    },
    {
        "id": 4,
        "title": "Sistemas operativos modernos",
        "author": "Andrew S. Tanenbaum",
        "year": "2007",
        "cover": "./img/04.jpg",
        "description": "Incluye temas sobre: capítulos nuevos sobre seguridad de computadoras, sistemas operativos multimedia y sistemas con múltiples procesadores. Amplia cobertura de Linux, UNIX y Windows 2000 como ejemplos. Un capítulo exclusivo sobre el diseño de sistemas operativos que no se halla en otros libros. Cobertura de interfaces gráficas de usuario, sistemas operativos para multiprocesadores, sistemas de confianza, virus, terminales de red, sistemas de archivos de CD-ROM, administración de energía en laptops, RAID...",
        "driveLink": "https://drive.google.com/file/d/1E8onPCKZNvXiTui9Nv-bZ0-rZJzDTOSe/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 5,
        "title": "Fundamentos de bases de datos",
        "author": "Abraham Silberschatz, Henry F. Korth y S Sudarshan",
        "year": "1998",
        "cover": "./img/05.jpg",
        "description": "No disponible",
        "driveLink": "https://drive.google.com/file/d/18Iy-GWlJN1nc8pEgrrLy6ShFBJiWwamq/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 6,
        "title": "Redes de Computadoras",
        "author": "Andrew S. Tanenbaum",
        "year": "2003",
        "cover": "./img/06.webp",
        "description": "Redes de computadoras, cuarta edición, es la introducción ideal a las redes de hoy... y del mañana. Este bestseller clásico ha sido cuidadosamente actualizado para reflejar las tecnologías de conectividad de redes más nuevas e importantes, con un énfasis especial en la conectividad inalámbrica, entre ellas el estándar 802.11, Bluetooth, los sistemas de banda ancha y las redes ad hoc, i-mode y WAP. También se abarcan las redes fijas, como ADSL, Internet por cable, Gigabit Ethernet, redes de igual a igual, NAT y MPLS. Incluye una gran cantidad de material nuevo sobre aplicaciones más de 60 páginas Web, además de la radio por Internet, voz sobre IP y vídeo bajo demanda. Por último, se reviso y amplió el tema de seguridad en la red, el cual abarca ahora un capítulo completo.",
        "driveLink": "https://drive.google.com/file/d/1Zh-68b5FNBp1pTLZlxUhh_3US4n6s56j/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 7,
        "title": "Comunicaciones y redes de computadores",
        "author": "William Stallings",
        "year": "2004",
        "cover": "./img/07.jpg",
        "description": "Índice abreviado: I. DESCRIPCIÓN GENERAL 1. Introducción a las comunicaciones de datos y redes 2. Arquitectura de protocolos II. COMUNICACIONES DE DATOS 3. Transmisión de datos 4. Medios de transmisión 5. Técnicas para la codificación de señales 6. Técnicas de comunicación de datos digitales 7. Protocolos de control del enlace de datos 8. Multiplexación 9. Espectro expandido III. REDES DE ÁREA AMPLIA 10. Conmutación de circuitos y de paquetes 11. Modo de transferencia asíncrono 12. Encaminamiento en redes conmutadas 13. Congestión en redes de datos 14. Redes celulares inalámbricas IV. REDES DE ÁREA LOCAL 15. Visión general de las redes de área local 16. Redes LAN de alta velocidad 17. Redes LAN inalámbricas V. PROTOCOLOS DE INTERCONEXIÓN 18. Protocolos de interconexión de redes 19. Funcionamiento de la interconexión de redes 20. Protocolos de transporte 21. Seguridad en redes 22. Aplicaciones distribuidas.",
        "driveLink": "https://drive.google.com/file/d/14VrSxYPERpYM4R9eLgjQ0VIvcc920SO6/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 8,
        "title": "Desarrollo de aplicaciones web",
        "author": "Carles Mateu",
        "year": "2023",
        "cover": "./img/08.jpg",
        "description": "Este libro gira en torno al funcionamiento y fundamento de lo que hoy conocemos como Internet. Internet, la red de redes, nace a mediados de la década de los setenta, bajo los auspicios de DARPA, la Agencia de Proyectos Avanzados para la Defensa de Estados Unidos. DARPA inició un programa de investigación de técnicas y tecnologías para unir diversas redes de conmutación de paquetes, permitiendo así a los ordenadores conectados a estas redes comunicarse entre sí de forma fácil y transparente. De estos proyectos nació un protocolo de comunicaciones de datos, IP o Internet Protocol, que permitía a ordenadores diversos comunicarse a través de una red, Internet, formada por la interconexión de diversas redes.",
        "driveLink": "https://drive.google.com/file/d/1EPg5ED5-19o_rbS-M-oZsNchhEmPMfLo/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 9,
        "title": "Introducción a la Informática",
        "author": "Carlos Brys",
        "year": "2019",
        "cover": "./img/09.jpg",
        "description": "Introducción a la Informática es un libro de Carlos Brys que aborda temas como los tipos de computadoras, el sistema binario, el hardware, entre otros. La informática es la ciencia que estudia el análisis y resolución de problemas con computadoras. Su objetivo es mejorar la eficiencia y productividad en el trabajo.",
        "driveLink": "https://drive.google.com/file/d/1qdW0EsFGwx7jQErprYObBNwuYE9yFgxJ/view?usp=drive_link",
        "categories": ["01. Introducción a la Informática"],
        "type": "Obligatoria"
    },
    {
        "id": 10,
        "title": "Python a fondo",
        "author": "Óscar Ramírez Jiménez",
        "year": "2021",
        "cover": "./img/10.webp",
        "description": "Python es el mejor lenguaje de programación tanto para novatos como para veteranos. Es usado en empresas y start-ups de primer nivel, y cada día es más demandado y reconocido mundialmente. Gracias a su carácter polivalente, Python se emplea en las FANG (Facebook, Amazon, Netflix y Google), en scripts simples, aplicaciones de domótica, programación de aplicaciones de escritorio o aplicaciones web complejas que soportan miles de usuarios por segundo, como Instagram o YouTube. Si quiere conocer a fondo este maravilloso lenguaje de programación, aprender a programar en un lenguaje de primer nivel y expandir su conocimiento sobre los lenguajes que conoce, este es su libro",
        "driveLink": "https://drive.google.com/file/d/1oRl5A2pubTRH4lh255c6FFtVmXFj1vZQ/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Obligatoria"
    },
    {
        "id": 11,
        "title": "Think Python",
        "author": "Allen B Downey ",
        "year": "2002",
        "cover": "./img/11.jpg",
        "description": "Think Python es una introducción a Python para quienes nunca han programado, o para quienes lo han intentado y les ha resultado difícil.",
        "driveLink": "https://drive.google.com/file/d/1gVV9rxTgg4WhiKDtXTotJYrJuXWg4H54/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Obligatoria"
    },
    {
        "id": 12,
        "title": "Introducing Python: Modern Computing in Simple Packages",
        "author": "Bill Lubanovic",
        "year": "2011",
        "cover": "./img/12.jpg",
        "description": "Fácil de entender y de leer, esta edición actualizada de Introducción a Python es ideal tanto para programadores principiantes como para quienes se inician en el lenguaje. El autor Bill Lubanovic te guía desde lo básico hasta temas más complejos y variados, combinando tutoriales con recetas de código estilo libro de cocina para explicar conceptos de Python 3. Los ejercicios al final de cada capítulo te ayudarán a practicar lo aprendido. Adquirirás una base sólida en el lenguaje, incluyendo las mejores prácticas para pruebas, depuración, reutilización de código y otros consejos de desarrollo. Este libro también te muestra cómo usar Python para aplicaciones en los ámbitos empresarial, científico y artístico, utilizando diversas herramientas de Python y paquetes de código abierto.",
        "driveLink": "https://drive.google.com/file/d/1otITmqdt0WALx-47LOWfittI7BR_ZWLn/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Obligatoria"
    },
    {
        "id": 13,
        "title": "Python Crash Course",
        "author": "Eric Matthes",
        "year": "2015",
        "cover": "./img/13.jpg",
        "description": "Curso Intensivo de Python es el libro de programación más vendido del mundo, ¡con más de 1.500.000 copias vendidas hasta la fecha! Curso Intensivo de Python es la guía más vendida del mundo sobre el lenguaje de programación Python. Esta introducción rápida y completa te permitirá escribir programas, resolver problemas y desarrollar aplicaciones funcionales en un abrir y cerrar de ojos. Comenzarás aprendiendo conceptos básicos de programación, como variables, listas, clases y bucles, y practicarás la escritura de código limpio con ejercicios para cada tema. También aprenderás a hacer tus programas interactivos y a probar tu código de forma segura antes de añadirlo a un proyecto. Pondrás en práctica tus nuevos conocimientos creando un juego arcade inspirado en Space Invaders, creando un conjunto de visualizaciones de datos con las prácticas bibliotecas de Python e implementando una aplicación sencilla en línea.",
        "driveLink": "https://drive.google.com/file/d/1yJnR3XTXnROCkAeDUVCZm4EnUZHpEfOv/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Obligatoria"
    },
    {
        "id": 14,
        "title": "Learn Python 3 the Hard Way",
        "author": "Zed A. Shaw",
        "year": "2013",
        "cover": "./img/14.jpg",
        "description": "¡Aprenderás Python 3! Zed Shaw ha perfeccionado el mejor sistema del mundo para aprender Python 3. Síguelo y triunfarás, ¡igual que los millones de principiantes a los que Zed ha enseñado hasta la fecha! Tú aportas la disciplina, el compromiso y la perseverancia; el autor proporciona todo lo demás. En Aprende Python 3 a la Dura, aprenderás Python resolviendo 52 ejercicios brillantemente diseñados. Léelos. Escribe el código con precisión. (¡Sin copiar y pegar!). Corrige tus errores. Observa cómo se ejecutan los programas. Mientras lo haces, aprenderás cómo funciona una computadora; cómo son los buenos programas; y cómo leer, escribir y pensar en código.",
        "driveLink": "https://drive.google.com/file/d/1_xkk4hC_d2gEBpdCx1-CsQ5ggs38qfVp/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Obligatoria"
    },
    {
        "id": 15,
        "title": "Learn More Python 3 the Hard Way",
        "author": "Zed A. Shaw",
        "year": "2017",
        "cover": "./img/15.jpg",
        "description": "Zed Shaw ha perfeccionado el mejor sistema del mundo para convertirte en un desarrollador de Python 3.x verdaderamente efectivo. Síguelo y triunfarás, al igual que las decenas de millones de programadores a los que ya ha enseñado. Tú aportas la disciplina, el compromiso y la perseverancia; el autor te proporciona todo lo demás. En este libro, Zed Shaw te enseñó los fundamentos de la programación con Python 3. Ahora, en Learn More Python 3 the Hard Way, irás mucho más allá de lo básico al trabajar en 52 proyectos brillantemente diseñados. Cada uno te ayuda a desarrollar una habilidad práctica clave, combinando demostraciones para empezar y desafíos para profundizar tu comprensión. Zed te enseña aún más en 12 horas de vídeos online, donde te muestra cómo romper, corregir y depurar tu código.",
        "driveLink": "https://drive.google.com/file/d/1IXqMIpjSBHGS3tSSpmCJPmaAHQnDDMeA/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Obligatoria"
    },
    {
        "id": 16,
        "title": "Algoritmos, datos y programas con aplicaciones en Pascal, Delphi y Visual Da Vinci",
        "author": "Armando E. De Giusti",
        "year": "2002",
        "cover": "./img/16.webp",
        "description": "La Informática es una disciplina ( y una fuente laboral) en crecimiento. Pese al enorme esfuerzo en la formación de recursos humanos en todo el mundo, la demanda y el costo laboral de los especialistas en Informática aumenta. Es claro que el eje de este crecimiento está en la aplicación cada vez más extendida de la tecnología informática.",
        "driveLink": "https://drive.google.com/file/d/1hM7SfFyZ2UNmRoO7-e1ebaFes4JRI7Mb/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Optativa"
    },
    {
        "id": 17,
        "title": "Programming in Python 3: A Complete Introduction to the Python Language",
        "author": "Mark Summerfield ",
        "year": "2009",
        "cover": "./img/17.jpg",
        "description": "Python 3 es, hasta la fecha, la mejor versión de este lenguaje: es más potente, práctico, consistente y expresivo que cualquier versión anterior. Ahora, el destacado programador de Python, Mark Summerfield, nos demuestra cómo codificar aprovechando todas las características y estilos de esta nueva versión. En este libro se reúnen todos los conocimientos necesarios para escribir cualquier programa, utilizar cualquier biblioteca Python 3 estándar o de un tercero, y crear nuevos módulos de bibliotecas propias. Este manual trata áreas tan interesantes como la creación de paquetes y módulos a medida, la escritura y lectura de archivos binarios, de texto y XML, la creación de aplicaciones GUI útiles y eficientes o técnicas de programación avanzada, como generadores, decoradores de clase y función, administradores de contexto, etc.",
        "driveLink": "https://drive.google.com/file/d/1q-GT0cQPYnoePSBx1WD2Xt8OGK2JBv8l/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Optativa"
    },
    {
        "id": 18,
        "title": "Beginning Python",
        "author": "Peter C. Norton, Alex Samuel, Dave Aitel",
        "year": "2005",
        "cover": "./img/18.jpg",
        "description": "Este tutorial ofrece a los lectores una introducción completa a la programación en Python 2.4, el lenguaje de programación portátil, interpretado y orientado a objetos que combina potencia con una sintaxis clara. Los programadores principiantes aprenderán rápidamente a desarrollar aplicaciones Python robustas, fiables y reutilizables para desarrollo web, aplicaciones científicas y tareas del sistema para usuarios o administradores. Aborda los fundamentos de la instalación de Python, así como las nuevas características de la versión 2.4 de Python, que facilitan la creación de aplicaciones científicas y web. Incluye ejemplos de varios sistemas operativos a lo largo del libro, incluyendo Linux, Mac OS X/BSD y Windows XP.",
        "driveLink": "https://drive.google.com/file/d/1sYovUA0W30qTLEIqe6pjODCZ99h4RIV4/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Optativa"
    },
    {
        "id": 19,
        "title": "Programación en Turbo/Borland Pascal",
        "author": "Luis Joyanes Aguilar",
        "year": "1989",
        "cover": "./img/19.jpg",
        "description": "Este libro se ha diseñado como un curso de programación en Pascal en las versiones 5.0/5.5, 6.0 y 7.0 de Turbo Pascal. Asimismo, puede ser utilizado con la nueva versión Borland Pascal 7.0 ejecutándose bajo el sistema operativo DOS. Busca conseguir dos objetivos complementarios: Enseñar a programar con un estilo depurado y enseñar técnicas de Turbo Pascal. Esta tercera edición ha ampliado considerablemente el contenido de las ediciones anteriores. De modo formal se han añadido dos capítulos más, para conformar un total de venticuatro, pero de modo práctico se han reestructurado y organizado con un orden distinto muchos de los capítulos, en base a la experiencia acumulada en los nueve años de vida del libro.",
        "driveLink": "https://drive.google.com/file/d/1onV5dInznjUsOdx3_ohvj7HzQ0Vly1XJ/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Optativa"
    },
    {
        "id": 20,
        "title": "Fundamentos de programación, algoritmos, estructura de datos y objetos",
        "author": "Luis Joyanes Aguilar",
        "year": "1996",
        "cover": "./img/20.jpg",
        "description": "Todas las historias publicadas sobre el nacimiento de las computadoras comienzan remontándose a la antigüedad con la creación del ábaco como primera máquina de cálculo. Este instrumento, inventado en Asia, se utilizó en la antigua Babilonia, en China y, por supuesto, en Europa. Actualmente se utiliza con fines educativos y de ocio. En 1642, el filósofo y matemático francés Blas Pascal inventó la primera calculadora mecánica, conocida como pascalina. La calculadora tenía una serie de engranajes (ruedas dentadas) que permitían realizar sumas y restas, con un método entonces ingenioso y revolucionario: cuando se giraban los dientes de la primera rueda, avanzaba un diente de la segunda rueda, al girar los dientes de la segunda rueda, avanzaba un diente de la tercera, y así sucesivamente. Tanto el ábaco como la pascalina sólo podían realizar sumas y restas. Asimismo, a finales del siglo XVII, en 1694, el científico alemán Gottfried Leibniz inventó una máquina que podía sumar, restar, multiplicar y dividir. En 1819, el francés Joseph Jacquard creó las bases de las tarjetas perforadas como soporte de información.",
        "driveLink": "https://drive.google.com/file/d/1eH2AiA0SZkGPJtOgqYwMkiWPxsZYrPmM/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Optativa"
    },
    {
        "id": 21,
        "title": "Python Fácil",
        "author": "Arnaldo Pérez Castaño",
        "year": "2014",
        "cover": "./img/21.jpg",
        "description": "Python es uno de los lenguajes más populares de la actualidad. Su sintaxis limpia y sus códigos compactos atraen a estudiantes, profesores y programadores que lo toman como herramienta para la enseñanza y para el desarrollo de proyectos de envergadura. Este libro incluye capítulos sumamente interesantes que abordan temas como los paradigmas de programación en Python, los iteradores y generadores, los decoradores y las metaclases, el procesamiento de ficheros (XML, HTML, CSV, ficheros comprimidos) y al final un capítulo dedicado al desarrollo de estructuras de datos (pilas, colas, listas enlazadas, árboles, árboles binarios, AVL, Rojo Negro, Trie, QuadTree, grafos, digrafos) y algoritmos (ordenamiento, grafos, matemáticas) en Python. Arnaldo Pérez Castaño es científico de la computación, graduado de la Universidad de la Habana y Técnico Medio en Contabilidad. Es autor de los libros JavaScript Fácil, HTML y CSS Fácil. Sirve como reviewer para Journal of Mathematical Modelling and Algorithms in Operations Research de Springer. Es amante del Jazz y del cine.Python es uno de los lenguajes más populares de la actualidad. Su sintaxis limpia y sus códigos compactos atraen a estudiantes, profesores y programadores que lo toman como herramienta para la enseñanza y para el desarrollo de proyectos de envergadura.",
        "driveLink": "https://drive.google.com/file/d/1QQiUFjLpA-_djJePFETLQf693IN3gmYN/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Optativa"
    },
    {
        "id": 22,
        "title": "Programación E1201: Curso de grado",
        "author": "Pablo Andrés García, Marcelo A. Haberman, Federico N. Guerrero",
        "year": "2021",
        "cover": "./img/22.jpg",
        "description": "Este libro surgió con el propósito de contar un material de referencia para los alumnos de la cátedra Programación-E1201 de la Facultad de Ingeniería de la UNLP. Aun así, la obra es accesible al público general que desee aprender la disciplina de la programación de computadoras. Aborda desde las bases de la programación y la creación de algoritmos con lenguajes sencillos hasta temas más complejos, como la administración de la memoria de la computadora y la programación orientada a objetos.",
        "driveLink": "https://drive.google.com/file/d/1NiaWN1ERybcuzd4kyTnJuWEqwJUWknJF/view?usp=drive_link",
        "categories": ["02. Programación I"],
        "type": "Optativa"
    },
    {
        "id": 23,
        "title": "Arquitectura de computadores: un enfoque cuantitativo",
        "author": "David A. Patterson y John L. Hennessy",
        "year": "1989",
        "cover": "./img/23.jpg",
        "description": "Arquitectura de Computadoras: Un Enfoque Cuantitativo, Sexta Edición, ha sido considerada una lectura esencial por instructores, estudiantes y profesionales del diseño de computadoras durante más de 20 años. La sexta edición de este clásico libro de texto de Hennessy y Patterson, ganadores del Premio ACM AM Turing 2017, que reconoce contribuciones de gran importancia técnica y duradera en el campo de la computación, está completamente revisada con los últimos avances en arquitectura de procesadores y sistemas. El texto ahora incluye ejemplos de la arquitectura del conjunto de instrucciones RISC-V (RISC Five), un conjunto de instrucciones RISC moderno desarrollado y diseñado para ser un estándar libre y de adopción abierta.",
        "driveLink": "https://drive.google.com/file/d/1Q1CcWp9xso_XaHc1uT2nmiJvZ_lMK8Nb/view?usp=drive_link",
        "categories": ["03. Arquitectura de Computadoras"],
        "type": "Obligatoria"
    },
    {
        "id": 24,
        "title": "Principios de arquitectura de computadoras",
        "author": "Miles J. Murdocca, Vincent P. Heuring",
        "year": "2002",
        "cover": "./img/24.jpg",
        "description": "Principios de arquitectura de computadoras es un recurso valioso para estudiantes y profesionales de la informática que desean obtener una base sólida en este campo. Su enfoque claro y completo lo convierte en una excelente opción tanto para el aprendizaje autodidacta como para su uso en cursos académicos.",
        "driveLink": "https://drive.google.com/file/d/1pFWkU88_kfrUObwGK_SH_Y5-4YeXG79L/view?usp=drive_link",
        "categories": ["03. Arquitectura de Computadoras"],
        "type": "Obligatoria"
    }
]